<!-- dflook/terraform-github-actions {"workspace":"fix-self-hosted","backend_type":"remote","plan_modifier":"b0290c8150ae92d755bd7f79918a5400b47951132d040bb679259d282742cb6d","backend":"92312d0fe1b20234ab1f453bdafdfbd60e2d17523d32151826aab44dfe69ad0b","plan_job_ref":"Job Test plan target and replace #382 at https://github.com/dflook/terraform-github-actions/actions/runs/7277293788","plan_hash":"0d8aa8490e877e3a0f8f5dd9d3e21aa94e42366dd45b4f10f110abcdc3091ae0","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-self-hosted__ workspace
Targeting resources: `random_string.count[0]`
With variables: `length = 5`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.count[0] will be created
+   resource "random_string" "count" {
+       id          = (known after apply)
+       length      = 5
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   count = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #382](https://github.com/dflook/terraform-github-actions/actions/runs/7277293788)